# Install the appropriate packages

In [64]:
from google.cloud import storage
import pandas as pd ## for dataset and eda
import numpy as np ## for eda
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
from wordcloud import WordCloud
from uszipcode import SearchEngine


%matplotlib inline

In [3]:
bucket_name = "firstprojectdl"

storage_client = storage.Client()
bucket = storage_client.get_bucket(bucket_name)

print(bucket)
print('Great, we now have access to our first bucket on google cloud storage where we put our data')

<Bucket: firstprojectdl>
Great, we now have access to our first bucket on google cloud storage where we put our data

# Read the datasets from google cloud storage

In [45]:
from google.cloud import storage
import pandas as pd

bucket_name = "firstprojectdl"

storage_client = storage.Client()
bucket = storage_client.get_bucket(bucket_name)

# When you have your files in a subfolder of the bucket.
my_prefix = "data/movieLens/movieLens100k/" # the name of the subfolder
blobs = bucket.list_blobs(prefix = my_prefix, delimiter = '/')

dfDict = {}
dateparse = lambda x: datetime.utcfromtimestamp(int(x)).strftime('%Y-%m-%d %H:%M:%S')

for blob in blobs:
    if(blob.name != my_prefix): # ignoring the subfolder itself 
        file_name = blob.name.replace(my_prefix, "")
        blob.download_to_filename(file_name) # download the file to the machine
        print(file_name)
        if file_name =='u.data':
            df = pd.read_csv(file_name, sep='\t', 
                            names=['user_id', 'movie_id', 'rating', 'timestamp'], 
                            parse_dates=['timestamp'], 
                            date_parser=dateparse) # load the rating data
        elif file_name == 'u.item':
            df = pd.read_csv('u.item', sep='|', encoding='latin-1',
                    names=['movie_id', 'movie_title', 'release_date', 'video_release_date', 'imdb_url', 'unknown', 'action', 
                           'adventure', 'animation', 'childrens', 'comedy', 'crime', 'documentary', 'drama', 'fantasy', 
                           'film_noir', 'horror', 'musical', 'mystery', 'romance', 'sci_fi', 'thriller', 'war', 'western']) # load the movie data
        elif file_name == 'u.user':
            df = pd.read_csv('u.user', sep='|', encoding='latin-1',
                     names=['user_id', 'age', 'gender', 'occupation', 'zip_code']) # user_df
        dfDict[file_name] = df
        



dfDict['rating'] = dfDict['u.data'] 
del dfDict['u.data'] 
        
dfDict['movie'] = dfDict['u.item'] 
del dfDict['u.item'] 

dfDict['user'] = dfDict['u.user'] 
del dfDict['u.user'] 

## This is the list of datasets we have for the movieLens 100k!!
print(list(dfDict))

u.data
u.item
u.user
['rating', 'movie', 'user']

In [46]:
rating = dfDict['rating']
movie = dfDict['movie']
user = dfDict['user']

In [47]:
rating.head()

   user_id  movie_id  rating           timestamp
0      196       242       3 1997-12-04 15:55:49
1      186       302       3 1998-04-04 19:22:22
2       22       377       1 1997-11-07 07:18:36
3      244        51       2 1997-11-27 05:02:03
4      166       346       1 1998-02-02 05:33:16

In [48]:
movie.head()

,movie_id,movie_title,release_date,video_release_date,imdb_url,unknown,action,adventure,animation,childrens,...,fantasy,film_noir,horror,musical,mystery,romance,sci_fi,thriller,war,western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [49]:
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# Explore the movie dataset

In [50]:
movie.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 24 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   movie_id            1682 non-null   int64
 1   movie_title         1682 non-null   object
 2   release_date        1681 non-null   object
 3   video_release_date  0 non-null      float64
 4   imdb_url            1679 non-null   object
 5   unknown             1682 non-null   int64
 6   action              1682 non-null   int64
 7   adventure           1682 non-null   int64
 8   animation           1682 non-null   int64
 9   childrens           1682 non-null   int64
 10  comedy              1682 non-null   int64
 11  crime               1682 non-null   int64
 12  documentary         1682 non-null   int64
 13  drama               1682 non-null   int64
 14  fantasy             1682 non-null   int64
 15  film_noir           1682 non-null   int64
 16  horror              1682 non-null   int64
 17  musical             1682 non-null   int64
 18  mystery             1682 non-null   int64
 19  romance             1682 non-null   int64
 20  sci_fi              1682 non-null   int64
 21  thriller            1682 non-null   int64
 22  war                 1682 non-null   int64
 23  western             1682 non-null   int64
dtypes: float64(1), int64(20), object(3)
memory usage: 315.5+ KB

In [52]:
movie.describe()

,movie_id,video_release_date,unknown,action,adventure,animation,childrens,comedy,crime,documentary,...,fantasy,film_noir,horror,musical,mystery,romance,sci_fi,thriller,war,western
count,1682.000000,0.0,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,...,1682.00000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000,1682.000000
mean,841.500000,NaN,0.001189,0.149227,0.080262,0.024970,0.072533,0.300238,0.064804,0.029727,...,0.01308,0.014269,0.054697,0.033294,0.036266,0.146849,0.060048,0.149227,0.042212,0.016052
std,485.695893,NaN,0.034473,0.356418,0.271779,0.156081,0.259445,0.458498,0.246253,0.169882,...,0.11365,0.118632,0.227455,0.179456,0.187008,0.354061,0.237646,0.356418,0.201131,0.125714
min,1.000000,NaN,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,421.250000,NaN,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,841.500000,NaN,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,1261.750000,NaN,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,...,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,1682.000000,NaN,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.00000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

#

In [ ]:
## video release date does not have any non null values
## release date needs to be parsed to datetime
## no need for the imdb url

In [53]:
movie.loc[:, 'release_date'] = pd.to_datetime(movie['release_date'])
#movie['release_date']

0      1995-01-01
1      1995-01-01
2      1995-01-01
3      1995-01-01
4      1995-01-01
          ...
1677   1998-02-06
1678   1998-02-06
1679   1998-01-01
1680   1994-01-01
1681   1996-03-08
Name: release_date, Length: 1682, dtype: datetime64[ns]

In [54]:
##  Checkout NaN values percent in each column
def check_nan_percent(df):
    columns_null_count = df.isnull().sum()
    null_percent_df = pd.DataFrame({'null_percent': (columns_null_count/df.shape[0])*100, 'total_null': columns_null_count})
    return null_percent_df[null_percent_df.null_percent>0]

In [55]:
check_nan_percent(movie)

                    null_percent  total_null
release_date            0.059453           1
video_release_date    100.000000        1682
imdb_url                0.178359           3

In [58]:
##removing video release date and imdb_url because they are unecessary
## we fill the missing value in release date by the mode
movie.drop(columns=['video_release_date', 'imdb_url'], inplace=True)
movie.release_date.fillna(value=movie.release_date.mode()[0], inplace=True)

check_nan_percent(movie)

Empty DataFrame
Columns: [null_percent, total_null]
Index: []

In [59]:
movie.head()

,movie_id,movie_title,release_date,unknown,action,adventure,animation,childrens,comedy,crime,...,fantasy,film_noir,horror,musical,mystery,romance,sci_fi,thriller,war,western
0,1,Toy Story (1995),1995-01-01,0,0,0,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),1995-01-01,0,1,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),1995-01-01,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
3,4,Get Shorty (1995),1995-01-01,0,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Copycat (1995),1995-01-01,0,0,0,0,0,0,1,...,0,0,0,0,0,0,0,1,0,0

# Explore rating!

In [60]:
rating.head()

   user_id  movie_id  rating           timestamp
0      196       242       3 1997-12-04 15:55:49
1      186       302       3 1998-04-04 19:22:22
2       22       377       1 1997-11-07 07:18:36
3      244        51       2 1997-11-27 05:02:03
4      166       346       1 1998-02-02 05:33:16

In [61]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    100000 non-null  int64
 1   movie_id   100000 non-null  int64
 2   rating     100000 non-null  int64
 3   timestamp  100000 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(3)
memory usage: 3.1 MB

In [62]:
rating.describe()

            user_id       movie_id         rating
count  100000.00000  100000.000000  100000.000000
mean      462.48475     425.530130       3.529860
std       266.61442     330.798356       1.125674
min         1.00000       1.000000       1.000000
25%       254.00000     175.000000       3.000000
50%       447.00000     322.000000       4.000000
75%       682.00000     631.000000       4.000000
max       943.00000    1682.000000       5.000000

All good with the ratings

In [63]:
check_nan_percent(rating)

Empty DataFrame
Columns: [null_percent, total_null]
Index: []

# Explore the user set

zip codes will be converted in town names

In [65]:
search = SearchEngine(simple_zipcode=True)

Start downloading data for simple zipcode database, total size 9MB ...
  1 MB finished ...
  2 MB finished ...
  3 MB finished ...
  4 MB finished ...
  5 MB finished ...
  6 MB finished ...
  7 MB finished ...
  8 MB finished ...
  9 MB finished ...
  10 MB finished ...
  Complete!

In [67]:
user['city'] = user['zip_code'].apply(lambda zip: search.by_zipcode(zip).major_city)
print(user['city'])

0               Tucson
1        Mountain View
2          Orange Park
3               Maumee
4           Pittsburgh
            ...
938    Fort Lauderdale
939             Boston
940           Portland
941        San Antonio
942    College Station
Name: city, Length: 943, dtype: object

In [68]:
user.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [69]:
check_nan_percent(user)

      null_percent  total_null
city      3.923648          37

37 zip codes could not be converted, we shall investigate

In [70]:
user[user['city'].isnull()]

     user_id  age gender     occupation zip_code  city
53        54   22      M      executive    66315  None
72        73   24      M        student    41850  None
73        74   39      M      scientist    T8H1N  None
85        86   26      M  administrator    46005  None
144      145   31      M  entertainment    V3N4P  None
166      167   37      M          other    L9G2B  None
185      186   39      F      executive    00000  None
193      194   38      M  administrator    02154  None
200      201   27      M         writer    E2A4H  None
332      333   47      M          other    V0R2M  None
457      458   47      M     technician    Y1A6B  None
489      490   29      F         artist    V5A2B  None
520      521   19      M        student    02146  None
523      524   56      M       educator    02159  None
577      578   31      M  administrator    M7A1A  None
593      594   46      M       educator    M4J2K  None
598      599   22      F        student    R3T5K  None
599      600   34      M     programmer    02320  None
606      607   49      F     healthcare    02154  None
633      634   39      M       engineer    T8H1N  None
658      659   31      M       educator    54248  None
670      671   21      M     programmer    91919  None
707      708   26      F      homemaker    96349  None
708      709   21      M          other    N4T1A  None
718      719   37      F          other    V0R2H  None
766      767   70      M       engineer    00000  None
775      776   30      M      librarian    51157  None
778      779   31      M        student    K7L5J  None
781      782   21      F         artist    33205  None
787      788   51      M  administrator    05779  None
841      842   40      M         writer    93055  None
847      848   46      M       engineer    02146  None
856      857   35      F  administrator    V1G4L  None
857      858   63      M       educator    09645  None
900      901   38      M      executive    L1V3W  None
915      916   27      M       engineer    N2L5N  None
922      923   21      M        student    E2E3R  None

the zip codes are actually invalid and we will not remove them and rather will apply the mode for imputation

In [71]:
user.city.fillna(value=user.city.mode()[0], inplace=True)

In [72]:
check_nan_percent(user)

Empty DataFrame
Columns: [null_percent, total_null]
Index: []

no more missing values since the 37 zip codes have been imputed